name: "classifier"
backend: "onnxruntime"
max_batch_size: 8

input [
  {
    name: "float_input"
    data_type: TYPE_FP32
    dims: [ 312 ]
  }
]
output [
  {
    name: "label"
    data_type: TYPE_INT64
    dims: [ 1 ]
    reshape: { shape: [ ] } 
  },
  {
    name: "probabilities"
    data_type: TYPE_FP32
    dims: [ 2 ]
  }
]
